# SQL Data Analysis Workshop

 This workshop is designed to help you build practical SQL skills by analyzing real-world business data. 
     
The tasks are divided into 4 levels to gradually progress from basic data retrieval to advanced analysis. Each level focuses on specific SQL concepts and challenges, allowing you to practice query writing, data filtering, aggregations, joins, and subqueries.
- Level 1: Basic SQL queries (SELECT, WHERE, ORDER BY, COUNT).
- Level 2: Aggregations (SUM, AVG, GROUP BY) and basic joins.
- Level 3: Complex joins, subqueries, and multi-table analysis.
- Level 4: Advanced analytical tasks focused on complex queries, subqueries, and aggregations..

This structured approach ensures you build confidence and expertise in SQL, preparing you for real-world data analysis challenges. ðŸš€

---
## Setup the work environment

#### 1. Library's import

In [1]:
import mysql.connector

# Establish the connection
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="bike"
)

# Create a cursor object
cursor = connection.cursor()
print("Connection established successfully.")


#Improts 
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
from sqlalchemy import create_engine

Connection established successfully.

#### 2. Connecting to the Database

In [2]:
connection = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database="bike"
)

# Create a cursor object
cursor = connection.cursor()
print("Connection established successfully.")

Connection established successfully.

#### 3. Setup for SQL Magic

In [3]:
%load_ext sql

In [4]:
%sql mysql+pymysql://root:@localhost/bike

Connecting to 'mysql+pymysql://root:***@localhost/bike'

In [5]:
%sql SELECT * FROM customers

Running query in 'mysql+pymysql://root:***@localhost/bike'

1445 rows affected.

+-------------+------------+-----------+----------------+----------------------------+-------------------------+-----------------+-------+----------+
| customer_id | first_name | last_name |     phone      |           email            |          street         |       city      | state | zip_code |
+-------------+------------+-----------+----------------+----------------------------+-------------------------+-----------------+-------+----------+
|      1      |   Debra    |   Burks   |      None      |   debra.burks@yahoo.com    |    9273 Thorne Ave.     |   Orchard Park  |   NY  |  14127   |
|      2      |   Kasha    |    Todd   |      None      |    kasha.todd@yahoo.com    |     910 Vine Street     |     Campbell    |   CA  |  95008   |
|      3      |   Tameka   |   Fisher  |      None      |   tameka.fisher@aol.com    |  769C Honey Creek St.   |  Redondo Beach  |   CA  |  90278   |
|      4      |   Daryl    |   Spence  |      None      |    daryl.spence@aol.com    |     988 Pearl Lane      |    Uniondale    |   NY  |  11553   |
|      5      | Charolette |    Rice   | (916) 381-6003 |  charolette.rice@msn.com   |      107 River Dr.      |    Sacramento   |   CA  |  95820   |
|      6      |  Lyndsey   |    Bean   |      None      |  lyndsey.bean@hotmail.com  |      769 West Road      |     Fairport    |   NY  |  14450   |
|      7      |  Latasha   |    Hays   | (716) 986-3359 |  latasha.hays@hotmail.com  | 7014 Manor Station Rd.  |     Buffalo     |   NY  |  14215   |
|      8      | Jacquline  |   Duncan  |      None      | jacquline.duncan@yahoo.com |      15 Brown St.       | Jackson Heights |   NY  |  11372   |
|      9      |  Genoveva  |  Baldwin  |      None      |  genoveva.baldwin@msn.com  |    8550 Spruce Drive    | Port Washington |   NY  |  11050   |
|      10     |  Pamelia   |   Newman  |      None      |  pamelia.newman@gmail.com  |    476 Chestnut Ave.    |      Monroe     |   NY  |  10950   |
+-------------+------------+-----------+----------------+----------------------------+-------------------------+-----------------+-------+----------+
Truncated to displaylimit of 10.


---
## Level 1: Beginner â€“ Basic Queries (using SQL Magic)

### Task 1: Retrieve all rows and columns from the customers table.

In [6]:
%sql SELECT * FROM customers

Running query in 'mysql+pymysql://root:***@localhost/bike'

1445 rows affected.

+-------------+------------+-----------+----------------+----------------------------+-------------------------+-----------------+-------+----------+
| customer_id | first_name | last_name |     phone      |           email            |          street         |       city      | state | zip_code |
+-------------+------------+-----------+----------------+----------------------------+-------------------------+-----------------+-------+----------+
|      1      |   Debra    |   Burks   |      None      |   debra.burks@yahoo.com    |    9273 Thorne Ave.     |   Orchard Park  |   NY  |  14127   |
|      2      |   Kasha    |    Todd   |      None      |    kasha.todd@yahoo.com    |     910 Vine Street     |     Campbell    |   CA  |  95008   |
|      3      |   Tameka   |   Fisher  |      None      |   tameka.fisher@aol.com    |  769C Honey Creek St.   |  Redondo Beach  |   CA  |  90278   |
|      4      |   Daryl    |   Spence  |      None      |    daryl.spence@aol.com    |     988 Pearl Lane      |    Uniondale    |   NY  |  11553   |
|      5      | Charolette |    Rice   | (916) 381-6003 |  charolette.rice@msn.com   |      107 River Dr.      |    Sacramento   |   CA  |  95820   |
|      6      |  Lyndsey   |    Bean   |      None      |  lyndsey.bean@hotmail.com  |      769 West Road      |     Fairport    |   NY  |  14450   |
|      7      |  Latasha   |    Hays   | (716) 986-3359 |  latasha.hays@hotmail.com  | 7014 Manor Station Rd.  |     Buffalo     |   NY  |  14215   |
|      8      | Jacquline  |   Duncan  |      None      | jacquline.duncan@yahoo.com |      15 Brown St.       | Jackson Heights |   NY  |  11372   |
|      9      |  Genoveva  |  Baldwin  |      None      |  genoveva.baldwin@msn.com  |    8550 Spruce Drive    | Port Washington |   NY  |  11050   |
|      10     |  Pamelia   |   Newman  |      None      |  pamelia.newman@gmail.com  |    476 Chestnut Ave.    |      Monroe     |   NY  |  10950   |
+-------------+------------+-----------+----------------+----------------------------+-------------------------+-----------------+-------+----------+
Truncated to displaylimit of 10.

### Task 2: Retrieve customers who live in the city "New York".

In [7]:
%sql SELECT * FROM customers where city = "New York"

Running query in 'mysql+pymysql://root:***@localhost/bike'

7 rows affected.

+-------------+------------+-----------+----------------+----------------------------+---------------------------+----------+-------+----------+
| customer_id | first_name | last_name |     phone      |           email            |           street          |   city   | state | zip_code |
+-------------+------------+-----------+----------------+----------------------------+---------------------------+----------+-------+----------+
|      16     |   Emmitt   |  Sanchez  | (212) 945-8823 | emmitt.sanchez@hotmail.com |   461 Squaw Creek Road    | New York |   NY  |  10002   |
|     178     |  Genoveva  |   Tyler   | (212) 152-6381 |  genoveva.tyler@gmail.com  |    8121 Windfall Ave.     | New York |   NY  |  10002   |
|     327     |   Sharie   |  Alvarez  | (212) 211-7621 |   sharie.alvarez@msn.com   | 987 West Leatherwood Dr.  | New York |   NY  |  10002   |
|     411     |  Octavia   |    Case   | (212) 171-1335 |    octavia.case@aol.com    |      40 Charles Road      | New York |   NY  |  10002   |
|     854     |   Phylis   |   Adkins  | (212) 325-9145 |   phylis.adkins@msn.com    |      7781 James Ave.      | New York |   NY  |  10002   |
|     927     | Guillermo  |    Hart   | (212) 652-7198 | guillermo.hart@hotmail.com |  81 Indian Summer Drive   | New York |   NY  |  10002   |
|     1016    |   Shenna   |   Benton  | (212) 578-2912 |   shenna.benton@msn.com    |   57 Shadow Brook Road    | New York |   NY  |  10002   |
+-------------+------------+-----------+----------------+----------------------------+---------------------------+----------+-------+----------+

### Task 3: Retrieve all products sorted by their price in descending order.

In [8]:
%sql SELECT product_name , list_price FROM products order by list_price DESC

Running query in 'mysql+pymysql://root:***@localhost/bike'

321 rows affected.

+----------------------------------------+------------+
|              product_name              | list_price |
+----------------------------------------+------------+
|     Trek Domane SLR 9 Disc - 2018      |  11999.99  |
|     Trek Domane SLR 8 Disc - 2018      |  7499.99   |
|    Trek Silque SLR 8 Women's - 2017    |  6499.99   |
|        Trek Emonda SLR 8 - 2018        |  6499.99   |
| Trek Domane SL Frameset Women's - 2018 |  6499.99   |
|     Trek Domane SL Frameset - 2018     |  6499.99   |
|    Trek Silque SLR 7 Women's - 2017    |  5999.99   |
|     Trek Domane SLR 6 Disc - 2018      |  5499.99   |
| Trek Domane SLR 6 Disc Women's - 2018  |  5499.99   |
|      Trek Domane SL 8 Disc - 2018      |  5499.99   |
+----------------------------------------+------------+
Truncated to displaylimit of 10.

### Task 4: Find Orders by Status

#### Task 4.1: Retrieve all orders with status "Completed".

In [9]:
%sql SELECT o.order_id, os.status_description  FROM order_statuses os join orders o on o.order_status = os.status_id where os.status_description = 'Completed'
# %sql SELECT *  FROM order_statuses

Running query in 'mysql+pymysql://root:***@localhost/bike'

1445 rows affected.

+----------+--------------------+
| order_id | status_description |
+----------+--------------------+
|    1     |     Completed      |
|    2     |     Completed      |
|    3     |     Completed      |
|    4     |     Completed      |
|    5     |     Completed      |
|    6     |     Completed      |
|    7     |     Completed      |
|    8     |     Completed      |
|    9     |     Completed      |
|    10    |     Completed      |
+----------+--------------------+
Truncated to displaylimit of 10.

#### Task 4.1: Retrieve count of orders with status "Rejected".

In [10]:
%sql SELECT o.order_id, os.status_description  FROM order_statuses os join orders o on o.order_status = os.status_id where os.status_description = 'Rejected'

Running query in 'mysql+pymysql://root:***@localhost/bike'

45 rows affected.

+----------+--------------------+
| order_id | status_description |
+----------+--------------------+
|    70    |      Rejected      |
|    76    |      Rejected      |
|   158    |      Rejected      |
|   185    |      Rejected      |
|   239    |      Rejected      |
|   246    |      Rejected      |
|   264    |      Rejected      |
|   349    |      Rejected      |
|   350    |      Rejected      |
|   357    |      Rejected      |
+----------+--------------------+
Truncated to displaylimit of 10.

### Task 5: Count how many customers exist in the customers table.

In [11]:
%sql SELECT count(1) FROM customers

Running query in 'mysql+pymysql://root:***@localhost/bike'

1 rows affected.

+----------+
| count(1) |
+----------+
|   1445   |
+----------+

---
## Level 2: Intermediate â€“ Aggregations and Basic Joins
##### (Task 1,2,3 using Pandas read_sql and Task 4,5 using execute and fetchall() in mysql.connector)

### Task 1: Calculate the total revenue (sum of list_price * quantity) from the order_items table.

In [12]:
%sql SELECT sum(quantity*list_price) revemue FROM order_items

Running query in 'mysql+pymysql://root:***@localhost/bike'

1 rows affected.

+------------+
|  revemue   |
+------------+
| 8578988.88 |
+------------+

### Task 2: Calculate the average price of products in the products table.

In [13]:
%sql SELECT avg(list_price) FROM products

Running query in 'mysql+pymysql://root:***@localhost/bike'

1 rows affected.

+-----------------+
| avg(list_price) |
+-----------------+
|   1520.591402   |
+-----------------+

### Task 3: Retrieve the number of orders placed by each customer.

In [14]:
tables = pd.read_sql("""SELECT c.customer_id, c.first_name, c.last_name , count(o.order_id) as num_of_orders  FROM customers c join orders o on o.customer_id = c.customer_id 
                        group by c.customer_id, c.first_name, c.last_name;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\2995158122.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT c.customer_id, c.first_name, c.last_name , count(o.order_id) as num_of_orders  FROM customers c join orders o on o.customer_id = c.customer_id

      customer_id  first_name last_name  num_of_orders
0               1       Debra     Burks              3
1               2       Kasha      Todd              3
2               3      Tameka    Fisher              3
3               4       Daryl    Spence              3
4               5  Charolette      Rice              3
...           ...         ...       ...            ...
1440         1441      Jamaal  Morrison              1
1441         1442      Cassie     Cline              1
1442         1443      Lezlie      Lamb              1
1443         1444      Ivette     Estes              1
1444         1445       Ester   Acevedo              1

[1445 rows x 4 columns]

### Task 4: Join Orders with Customers

#### Task 4.1: Retrieve customer names along with their order IDs.

In [15]:
tables = pd.read_sql("""SELECT c.customer_id, c.first_name, c.last_name , o.order_id  FROM customers c join orders o on o.customer_id = c.customer_id ;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\3683638613.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT c.customer_id, c.first_name, c.last_name , o.order_id  FROM customers c join orders o on o.customer_id = c.customer_id ;""", connection)

      customer_id first_name last_name  order_id
0               1      Debra     Burks       599
1               1      Debra     Burks      1555
2               1      Debra     Burks      1613
3               2      Kasha      Todd       692
4               2      Kasha      Todd      1084
...           ...        ...       ...       ...
1610         1441     Jamaal  Morrison      1366
1611         1442     Cassie     Cline      1036
1612         1443     Lezlie      Lamb       558
1613         1444     Ivette     Estes       616
1614         1445      Ester   Acevedo      1424

[1615 rows x 4 columns]

#### Task 4.2: Retrieve Customer Names with Order IDs and Total Orders

In [16]:
tables = pd.read_sql("""SELECT  c.customer_id, c.first_name, c.last_name , o.order_id , count(o.order_id ) as total_orders  FROM customers c  join orders o on o.customer_id = c.customer_id 
                     group by  c.customer_id, c.first_name, c.last_name , o.order_id ;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\3688673834.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT  c.customer_id, c.first_name, c.last_name , o.order_id , count(o.order_id ) as total_orders  FROM customers c  join orders o on o.customer_id = c.customer_id

      customer_id first_name last_name  order_id  total_orders
0               1      Debra     Burks       599             1
1               1      Debra     Burks      1555             1
2               1      Debra     Burks      1613             1
3               2      Kasha      Todd       692             1
4               2      Kasha      Todd      1084             1
...           ...        ...       ...       ...           ...
1610         1441     Jamaal  Morrison      1366             1
1611         1442     Cassie     Cline      1036             1
1612         1443     Lezlie      Lamb       558             1
1613         1444     Ivette     Estes       616             1
1614         1445      Ester   Acevedo      1424             1

[1615 rows x 5 columns]

### Task 5: Retrieve products with stock quantities less than 50.

In [17]:
tables = pd.read_sql("""SELECT p.product_name, s.quantity FROM products p join stocks s on s.product_id = p.product_id  where  s.quantity < 50;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\2984933857.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT p.product_name, s.quantity FROM products p join stocks s on s.product_id = p.product_id  where  s.quantity < 50;""", connection)

                                 product_name  quantity
0                             Trek 820 - 2016        27
1                             Trek 820 - 2016        14
2                             Trek 820 - 2016        14
3          Ritchey Timberwolf Frameset - 2016         5
4          Ritchey Timberwolf Frameset - 2016        16
..                                        ...       ...
934  Electra Townie Commute 8D Ladies' - 2018         2
935  Electra Townie Commute 8D Ladies' - 2018        18
936  Electra Townie Original 1 Ladies' - 2018        14
937  Electra Townie Original 1 Ladies' - 2018        24
938  Electra Townie Original 1 Ladies' - 2018         0

[939 rows x 2 columns]

---

## Level 3: Advanced â€“ Complex Joins and Subqueries
(using Pandas read_sql)

### Task 1: Retrieve the Top 5 Products with the Highest Total Sales Revenue

In [18]:
tables = pd.read_sql("""SELECT p.product_name , sum(ol.quantity*ol.list_price) as revenue FROM products p join order_items ol on ol.product_id = p.product_id  group by (product_name) order by revenue DESC limit 5;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\2575561626.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT p.product_name , sum(ol.quantity*ol.list_price) as revenue FROM products p join order_items ol on ol.product_id = p.product_id  group by (product_name) order by revenue DESC limit 5;""", connection)

                    product_name    revenue
0       Trek Slash 8 27.5 - 2016  615998.46
1           Trek Conduit+ - 2016  434998.55
2       Trek Fuel EX 8 29 - 2016  414698.57
3    Surly Straggler 650b - 2016  253829.49
4  Trek Domane SLR 6 Disc - 2017  236499.57

### Task 2: Find the Customers Who Placed the Most Orders in June, November 2018

In [19]:
tables = pd.read_sql("""SELECT c.customer_id, c.first_name, c.last_name , count(o.order_id) as total_orders  FROM customers c join orders o on o.customer_id = c.customer_id 
                       where (month(o.order_date) in (6,11) and year(o.order_date) = 2018 ) group by c.customer_id, c.first_name, c.last_name order by ( total_orders);""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\3361298720.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT c.customer_id, c.first_name, c.last_name , count(o.order_id) as total_orders  FROM customers c join orders o on o.customer_id = c.customer_id

   customer_id first_name last_name  total_orders
0            1      Debra     Burks             1
1            7    Latasha      Hays             1
2          135    Dorthey   Jackson             1

### Task 3: List All Stores with Their Total Stock Quantities for All Products

In [20]:
tables = pd.read_sql("""SELECT s.store_Name ,sum(st.quantity) as total_stock  FROM stores s join stocks st on st.store_id = s.store_id 
                        group by s.store_Name order by  total_stock desc;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\148610821.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT s.store_Name ,sum(st.quantity) as total_stock  FROM stores s join stocks st on st.store_id = s.store_id

         store_Name  total_stock
0     Rowlett Bikes       4620.0
1  Santa Cruz Bikes       4532.0
2     Baldwin Bikes       4359.0

### Task 4: Retrieve Staff Members Who Work at Stores Located in a Specific State
California (CA) , New York (NY) , Texas (TX)

In [21]:
tables = pd.read_sql("""SELECT s.store_id ,st.first_name, st.last_name, s.store_name, s.state as total_stock  FROM stores s join staffs st on st.store_id = s.store_id 
                       where s.state in ('CA','NY','TX') ;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\3007743730.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT s.store_id ,st.first_name, st.last_name, s.store_name, s.state as total_stock  FROM stores s join staffs st on st.store_id = s.store_id

   store_id  first_name last_name        store_name total_stock
0         1     Fabiola   Jackson  Santa Cruz Bikes          CA
1         1      Mireya  Copeland  Santa Cruz Bikes          CA
2         1       Genna   Serrano  Santa Cruz Bikes          CA
3         1      Virgie   Wiggins  Santa Cruz Bikes          CA
4         2    Jannette     David     Baldwin Bikes          NY
5         2   Marcelene     Boyer     Baldwin Bikes          NY
6         2      Venita    Daniel     Baldwin Bikes          NY
7         3        Kali    Vargas     Rowlett Bikes          TX
8         3       Layla   Terrell     Rowlett Bikes          TX
9         3  Bernardine   Houston     Rowlett Bikes          TX

### Task 5: Identify the Categories of Products with the Highest Total Revenue

In [22]:
tables = pd.read_sql("""SELECT c.category_name , sum(o.quantity*o.list_price)  as total FROM categories c join products p  on p.category_id = c.category_id 
                     join order_items o on o.product_id = p.product_id group by c.category_name order by total desc limit 1 ;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\623010856.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT c.category_name , sum(o.quantity*o.list_price)  as total FROM categories c join products p  on p.category_id = c.category_id

    category_name       total
0  Mountain Bikes  3030775.71

---
## Level 4: Expert â€“ Advanced Analytical Queries
(using Pandas read_sql)

### Task 1: Find the Store with the Highest Total Revenue
Retrieve the store name and total revenue (sum of list_price * quantity) across all orders.

In [23]:
tables = pd.read_sql("""SELECT s.store_name , sum(od.quantity*od.list_price)  as total_revenue FROM stores s join orders o   on o.store_id = s.store_id 
                     join order_items od on od.order_id = o.order_id group by s.store_name order by total_revenue desc limit 1 ;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\3224674298.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT s.store_name , sum(od.quantity*od.list_price)  as total_revenue FROM stores s join orders o   on o.store_id = s.store_id

      store_name  total_revenue
0  Baldwin Bikes     5826242.21

### Task 2: Find all products that have never been ordered.

In [24]:
tables = pd.read_sql("""SELECT p.product_id, p.product_name
FROM products p LEFT JOIN order_items oi ON p.product_id = oi.product_id
WHERE oi.product_id IS NULL order by product_id;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\2446894412.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT p.product_id, p.product_name

    product_id                                    product_name
0            1                                 Trek 820 - 2016
1          121                   Surly Krampus Frameset - 2018
2          125                    Trek Kids' Dual Sport - 2018
3          154           Trek Domane SLR 6 Disc Women's - 2018
4          195            Electra Townie Go! 8i Ladies' - 2018
5          267                Trek Precaliber 12 Girl's - 2018
6          284    Electra Savannah 1 (20-inch) - Girl's - 2018
7          291  Electra Sweet Ride 1 (20-inch) - Girl's - 2018
8          316            Trek Checkpoint ALR 4 Women's - 2019
9          317                    Trek Checkpoint ALR 5 - 2019
10         318            Trek Checkpoint ALR 5 Women's - 2019
11         319             Trek Checkpoint SL 5 Women's - 2019
12         320                     Trek Checkpoint SL 6 - 2019
13         321             Trek Checkpoint ALR Frameset - 2019

### Task 3: Identify the Customers Who Placed the Fewest Orders
Retrieve customer names and their total order counts, ordered in ascending order of order count.

In [25]:
tables = pd.read_sql("""SELECT c.customer_id, c.first_name,c.last_name, count(o.order_id)  as total_orders FROM customers c join orders o   on o.customer_id = c.customer_id 
                         group by c.customer_id, c.first_name,c.last_name  ORDER BY total_orders,c.customer_id ASC LIMIT 5;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\3871136301.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT c.customer_id, c.first_name,c.last_name, count(o.order_id)  as total_orders FROM customers c join orders o   on o.customer_id = c.customer_id

   customer_id first_name   last_name  total_orders
0           95    Letitia      Franco             1
1           96   Floretta     Higgins             1
2           98     Violet  Valenzuela             1
3           99      Carie        Kidd             1
4          100     Kellie      Franco             1

### Task 4: Analyze Monthly Revenue for the Last Year (Specific to 2017)

In [26]:
tables = pd.read_sql("""SELECT month(order_date) as month, sum(od.quantity*od.list_price) as monthly_revenue FROM order_items od join orders o   on o.order_id = od.order_id 
                      where  YEAR(order_date) = 2017  group by month  ;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\3543194523.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT month(order_date) as month, sum(od.quantity*od.list_price) as monthly_revenue FROM order_items od join orders o   on o.order_id = od.order_id

    month  monthly_revenue
0       1        316954.77
1       2        348740.47
2       3        348177.13
3       4        254105.57
4       5        297754.66
5       6        419892.07
6       7        255727.63
7       8        322553.32
8       9        329388.68
9      10        345316.18
10     11        315881.67
11     12        291022.87

### Task 5: Find Products That Are Low in Stock Across All Stores
Identify products where the total stock quantity (across all stores) is less than 100.

In [27]:
tables = pd.read_sql("""SELECT p.product_id, p.product_name, sum(st.quantity)  as total_stocks FROM Products p join stocks st   on st.product_id = p.product_id 
                     join stores s on s.store_id = st.store_id   group by p.product_id, p.product_name having total_stocks <100 ;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\534530489.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT p.product_id, p.product_name, sum(st.quantity)  as total_stocks FROM Products p join stocks st   on st.product_id = p.product_id

     product_id                              product_name  total_stocks
0             1                           Trek 820 - 2016          55.0
1             2        Ritchey Timberwolf Frameset - 2016          45.0
2             3           Surly Wednesday Frameset - 2016          34.0
3             4                  Trek Fuel EX 8 29 - 2016          36.0
4             5              Heller Shagamaw Frame - 2016          26.0
..          ...                                       ...           ...
308         309         Electra Townie Commute 27D - 2018          46.0
309         310  Electra Townie Commute 27D Ladies - 2018          31.0
310         311          Electra Townie Commute 8D - 2018          70.0
311         312  Electra Townie Commute 8D Ladies' - 2018          43.0
312         313  Electra Townie Original 1 Ladies' - 2018          38.0

[313 rows x 3 columns]


---

## Level 5: Additional Advanced SQL
(using Pandas read_sql)

### Task 1: Aggregate Sales by City and State
Write a query to calculate the total sales, average order value, and maximum order value for customers in each city and state.

In [28]:
tables = pd.read_sql("""SELECT city, state, count(o.customer_id)  as customer_count , sum(od.quantity*od.list_price)  as total_sales , avg(od.quantity*od.list_price)  as average_order_value
                      , max(od.quantity*od.list_price)  as max_order_value

                      FROM customers c join orders o   on o.customer_id = c.customer_id 
                     join order_items od on od.order_id = o.order_id 
                       group by city, state  ORDER BY total_sales DESC     ;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\4245242122.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT city, state, count(o.customer_id)  as customer_count , sum(od.quantity*od.list_price)  as total_sales , avg(od.quantity*od.list_price)  as average_order_value

,city,state,customer_count,total_sales,average_order_value,max_order_value
0,Mount Vernon,NY,60,117010.21,1950.170167,9999.98
1,Ballston Spa,NY,52,110065.34,2116.641154,11999.98
2,San Angelo,TX,53,109729.26,2070.363396,10999.98
3,Baldwinsville,NY,37,105893.45,2861.985135,12999.98
4,Howard Beach,NY,36,104250.51,2895.847500,23999.98
...,...,...,...,...,...,...
190,Copperas Cove,TX,4,3337.94,834.485000,1319.98
191,Far Rockaway,NY,5,3249.94,649.988000,899.98
192,Springfield Gardens,NY,3,1889.95,629.983333,879.98
193,Westbury,NY,2,1437.98,718.990000,898.00
194,Tonawanda,NY,2,1347.99,673.995000,858.00

In [29]:
tables = pd.read_sql("""SELECT city from customers  ;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\2674466981.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT city from customers  ;""", connection)

               city
0      Orchard Park
1          Campbell
2     Redondo Beach
3         Uniondale
4        Sacramento
...             ...
1440  Staten Island
1441       Brooklyn
1442  Central Islip
1443    Canandaigua
1444    San Lorenzo

[1445 rows x 1 columns]

### Task 2: Find Top-Selling Products in 2018
Write a query to identify the products with the highest sales volume in the year 2018.

In [30]:
tables = pd.read_sql("""SELECT p.product_id, year(o.order_date) as order_year, p.product_name , sum(od.quantity)  as total_solid_unit 

                      FROM products p join order_items od   on od.product_id = p.product_id 
                     join orders o on o.order_id = od.order_id  where year(o.order_date) =2018  group by p.product_id, year(o.order_date), p.product_name  ORDER BY total_solid_unit DESC ;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\1107700501.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT p.product_id, year(o.order_date) as order_year, p.product_name , sum(od.quantity)  as total_solid_unit

,product_id,order_year,product_name,total_solid_unit
0,86,2018,Trek Girl's Kickster - 2017,12.0
1,252,2018,Electra Townie Commute Go! Ladies' - 2018,11.0
2,92,2018,Haro Shredder 20 - 2017,11.0
3,263,2018,Strider Classic 12 Balance Bike - 2018,11.0
4,235,2018,Electra Koa 3i Ladies' - 2018,11.0
...,...,...,...,...
296,170,2018,Trek CrossRip 2 - 2018,1.0
297,72,2018,Sun Bicycles Biscayne Tandem 7 - 2017,1.0
298,201,2018,Trek Powerfly 5 FS - 2018,1.0
299,280,2018,Trek Superfly 24 - 2017/2018,1.0
300,174,2018,Trek Domane SLR Disc Frameset - 2018,1.0

### Task 3: Calculate Month-over-Month Sales Growth
Write a query to calculate the month-over-month sales growth for the past years.

In [31]:
tables = pd.read_sql("""SELECT year(o.order_date) as year, month(o.order_date) as month, sum(od.quantity)  as unit_sold , sum(od.quantity*od.list_price)  as total_sales

                      FROM  order_items od   join orders o on o.order_id = od.order_id 
                       group by year,month ORDER BY year, month ;""", connection)
tables

C:\Users\HP\AppData\Local\Temp\ipykernel_17528\2332291787.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  tables = pd.read_sql("""SELECT year(o.order_date) as year, month(o.order_date) as month, sum(od.quantity)  as unit_sold , sum(od.quantity*od.list_price)  as total_sales

    year  month  unit_sold  total_sales
0   2016      1      221.0    241184.15
1   2016      2      223.0    175768.10
2   2016      3      213.0    202157.14
3   2016      4      176.0    187223.55
4   2016      5      224.0    228701.13
5   2016      6      199.0    231120.29
6   2016      7      211.0    222854.21
7   2016      8      251.0    253130.83
8   2016      9      281.0    303282.61
9   2016     10      254.0    235051.79
10  2016     11      181.0    205315.47
11  2016     12      229.0    223695.20
12  2017      1      229.0    316954.77
13  2017      2      263.0    348740.47
14  2017      3      296.0    348177.13
15  2017      4      248.0    254105.57
16  2017      5      241.0    297754.66
17  2017      6      296.0    419892.07
18  2017      7      249.0    255727.63
19  2017      8      287.0    322553.32
20  2017      9      237.0    329388.68
21  2017     10      296.0    345316.18
22  2017     11      241.0    315881.67
23  2017     12      216.0    291022.87
24  2018      1      241.0    426301.72
25  2018      2      160.0    223941.44
26  2018      3      290.0    406701.20
27  2018      4      580.0    909179.47
28  2018      6        1.0       209.99
29  2018      7       11.0     12949.89
30  2018      8        9.0     10256.91
31  2018      9        4.0      9949.96
32  2018     10        8.0      4219.92
33  2018     11        8.0     12278.93
34  2018     12        4.0      7999.96